In [28]:
import sqlite3

In [31]:
# Connecting to sqlite
# connection object
conn = sqlite3.connect('INSTRUCTOR1.db')

In [32]:
# cursor object
cursor = conn.cursor()

In [33]:
# Drop the table if already exists.
cursor.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [34]:
# Creating table
table = """ create table IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""
 
cursor.execute(table)
 
print("Table is Ready")

Table is Ready

In [35]:
cursor.execute('''insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

In [36]:
cursor.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

In [37]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor.execute(statement)

print("All the data")
output_all = cursor.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [38]:
## Fetch few rows from the table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor.execute(statement)
  
print("All the data")
# If you want to fetch few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor.fetchmany(2) 
for row_many in output_many:
  print(row_many)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [39]:
# Fetch only FNAME from the table
statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor.execute(statement)
  
print("All the data")
output_column = cursor.fetchall()
for fetch in output_column:
    print(fetch)

All the data
('Rav',)
('Raul',)
('Hima',)

In [40]:
query_update='''update INSTRUCTOR set CITY='MOOSETOWN' where FNAME="Rav"'''
cursor.execute(query_update)

In [41]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor.execute(statement)
  
print("All the data")
output1 = cursor.fetchmany(2)
for row in output1:
  print(row)

All the data
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [42]:
import pandas as pd
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor;", conn)

#print the dataframe
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [43]:
#print just the LNAME for first row in the pandas data frame
df.LNAME[0]

'Ahuja'

In [44]:
df.shape

(3, 5)

In [45]:
# Close the connection
conn.close()